import React, { useState } from 'react'
import Card from '../components/Post'
import Post from '../components/Post';

const Home = () => {

    const [posts,setPostDetail]= useState([]);

    const blogList = [
      {
        id: "1",
        title:
          "ช่องบูมเมอแรง ได้ไปต่อ! MVTV Thailand ทุ่ม 200 ล้าน ให้เด็กไทยชมฟรีต่อเนื่อง",
        cover:
          "https://s.isanook.com/mv/0/ud/30/152539/boomerang.jpg?ip/crop/w1200h700/q80/webp",
        author: "sanook",
        createdAt: "2023-10-31",
        summary:
          "บริษัท เอ็มวีทีวี ไทยแลนด์ ทุ่มงบ 200 ล้าน ซื้อลิขสิทธิ์ช่องการ์ตูนดัง บูมเมอแรง (ฺBoomerang) เป็นของขวัญให้เด็กไทย ได้รับชมฟรีต่อเนื่อง หลังจากที่มีข่าวว่าช่อง บูมเมอแรง จะยุติการออกอากาศในวันที่ 1 กันยายน 2566 นี้ ในวันนี้ (31 ส.ค.) เฟซบุ๊กเพจ Boomerang Thailand แจ้งข่าวดีว่า บริษัท เอ็มวีทีวี ไทยแลนด์ ทุ่มงบ 200 ล้าน ซื้อลิขสิทธิ์ช่องการ์ตูนดัง บูมเมอแรง (ฺBoomerang) ให้เด็กไทยได้ชมกันอย่างต่อเนื่องฟรีๆ ต่อไปเรียบร้อยแล้ว",
      },
      {
        id: "2",
        title:
          'หมีพี่น้องสุดน่ารัก "We Baby Bears" ภาคแยกของซีรีส์การ์ตูน We Bare Bears เตรียมฉายแล้ว!',
        cover:
          "https://s.isanook.com/mv/0/ud/23/118049/webabybears.jpg?ip/crop/w1200h700/q80/webp",
        author: "sanook",
        createdAt: "2022-12-5",
        summary:
          "เตรียมตัวออกเดินทางท่องเที่ยวไปยังดินแดนแสนไกลพร้อมกับ We Baby Bears ออริจินัลซีรีส์แอนิเมชันคอมเมดี้ ผลิตโดย Cartoon Network Studios ว่าด้วยเรื่องราวการผจญภัยอันมหัศจรรย์ของเหล่าพี่น้องอันเป็นที่รักเพื่อค้นหาสถานที่ที่พวกเขาสามารถเรียกว่าบ้านได้ เข้าฉายสองตอนแรกในวันเสาร์ที่ 8 มกราคม 2022 เวลา 9.30 น. และสามารถรับชมตอนใหม่ได้ทุกวันเสาร์ ทาง Cartoon Network (3BB GIGA TV ช่อง 301, AIS Play ช่อง 402, True Vision ช่อง 453)",
      },
      {
        id: "3",
        title:
          "เรื่องย่อ Zootopia 2 (2025) กวาดรายได้ทั่วโลกพุ่ง 556 ล้านดอลลาร์ สรุปข้อมูลล่าสุด",
        cover:
          "https://static.thairath.co.th/media/Dtbezn3nNUxytg04aviCNVbwXLBurLsqet5TkNeEU1NyGV.webp",
        author: "sanook",
        createdAt: "2023-10-31",
        summary:
          "Zootopia 2 หรือ ชื่อภาษาไทย นครสัตว์มหาสนุก 2 ขึ้นแท่นแอนิเมชั่นมาแรงที่สุดส่งท้ายปี 2025 หลังจากเปิดตัวทั่วโลกด้วยรายได้สูงถึง 556 ล้านดอลลาร์สหรัฐ ประสบความสำเร็จแบบถล่มทลายตั้งแต่สัปดาห์แรกทั้งนี้ มีรายงานว่า Zootopia 2 ทำรายได้รวมมาจากโรงภาพยนตร์ในอเมริกาเหนือประมาณ 156 ล้านดอลลาร์ ขณะที่ตลาดต่างประเทศช่วยดันตัวเลขอีกกว่า 400 ล้านดอลลาร์ ซึ่งในจำนวนนี้ จีนถือเป็นตลาดหลักที่สร้างรายได้มากถึง 272 ล้านดอลลาร์เพียงประเทศเดียวกระแสที่แรงต่อเนื่องของหนัง Zootopia ภาคต่อเรื่องนี้ ทำให้สร้างสถิติใหม่หลายรายการ ทั้งแอนิเมชั่นดิสนีย์ที่เปิดตัวสัปดาห์แรกสูงที่สุด และแอนิเมชั่นภาคต่อที่ทำรายได้สัปดาห์แรกทั่วโลกดีที่สุดในปี 2025 นอกจากนี้ยังครองตำแหน่งแอนิเมชั่นที่เปิดตัวสูงสุดในจีนของปีนี้ อีกทั้งยังทำรายได้ในไทยพุ่งถึง 100 ล้านบาทแล้ว",
      },
      {
        id: "4",
        title:
          "เทียบ Pokemon ในหนัง Detective Pikachu เหมือน vs ต่าง จากเกมขนาดไหน?",
        cover:
          "https://s.isanook.com/mv/0/ud/16/82937/page.jpg?ip/crop/w1200h700/q80/webp",
        author: "sanook",
        createdAt: "2023-10-31",
        summary:
          "เชื่อว่าตอนนี้คนที่เล่นเกมหรือไม่ได้เล่น Pokemon ต่างก็คงจะได้ดูหรือได้ข่าวหนังที่กำลังจะฉายอย่าง Detective Pikachu หนังที่เป็นการขยายจักรวาลของเหล่า Pokemon ในฉบับคนแสดงที่น่าสนใจ และในตัวอย่างก็มี Pokemon หลายตัวปรากฏตัวออกมาอย่างมากมาย มาวันนี้เราเลยรวบรวมตัวละคร Pokemon ที่ปรากฏในตัวอย่างให้ชมกัน ว่าจะเหมือนหรือต่างกับในฉบับเกมตรงไหน และบางตัวมีที่มาที่ไปในการออกแบบอย่างไรมาดูกัน",
      },
    ];

    useState(() => {
        setPostDetail(blogList);
    }, [])
  return (
    <div className='space-y-4'>
    {posts.map((post,index) => (
       <Post postDetail={post} index = {index} key={post.id}/>
    ))}
    </div>
  )
}

export default Home